{
  "conversation":
  [
    {
      "id": 1,
      "nextId": 2,
      "speakersName": "Delta",
      "characterSpritesName": "Delta",
      "startingSprite": "Default",
      "theme": "VNT_Default",
      "sentences":
      [
        "Look, Blake. We’re both on edge. Let’s take a step back, cool off for a second. This isn’t getting us anywhere."
      ]
    },

    {
      "id": 2,
      "nextId": 3,
      "speakersName": "Blake",
      "characterSpritesName": "Blake",
      "startingSprite": "Default",
      "theme": "VNT_Default",
      "sentences":
      [
        "No, Delta. We’re not stepping back.",
        "You know what it’s like to see the faces of people you’ve killed on the morning news? To hear their names, their stories? It fucks you up. I see them, every damn time I close my eyes."
      ]
    },

    {
      "id": 3,
      "nextId": 4,
      "speakersName": "Delta",
      "characterSpritesName": "Delta",
      "startingSprite": "Default",
      "theme": "VNT_Default",
      "sentences":
      [
        "Oh, spare me the fucking sob story. You showed up for every job, didn't you? Again and again. And don’t act like you were dragged in kicking and screaming.",
        "We’re barely through the first act, and you were right there, front row, begging for the next hit."
      ]
    },

    {
      "id": 4,
      "nextId": 5,
      "speakersName": "Blake",
      "characterSpritesName": "Blake",
      "startingSprite": "Default",
      "theme": "VNT_Default",
      "sentences":
      [
        "I needed the money, Delta. I needed it to survive, to keep going."
      ]
    },

    {
      "id": 5,
      "nextId": 6,
      "speakersName": "Delta",
      "characterSpritesName": "Delta",
      "startingSprite": "Default",
      "theme": "VNT_Default",
      "sentences":
      [
        "The money? Are you fucking kidding me? That’s your excuse?",
        "The cash wasn’t what kept you coming back. It was the junk. You needed the heroin like a fish needs water. And now you wanna stand there and give me a fucking morality lecture?"
      ]
    },

    {
      "id": 6,
      "nextId": 7,
      "speakersName": "Blake",
      "characterSpritesName": "Blake",
      "startingSprite": "Default",
      "theme": "VNT_Default",
      "sentences":
      [
        "You were always like this, twisting shit around, making me think I needed you. Making me think this was the only way out. You pushed me into this life, made me think I had no choice."
      ]
    },

    {
      "id": 7,
      "nextId": 8,
      "speakersName": "Delta",
      "characterSpritesName": "Delta",
      "startingSprite": "Default",
      "theme": "VNT_Default",
      "sentences":
      [
        "Oh, don’t turn this on me. You came to me. You chose this. I didn’t put a gun to your head and drag you out there. You wanted it. You fucking needed it.",
        "The adrenaline, the rush, the blood. It was your escape from that sad, washed-up life of yours.",
        "Your band was gone, your career was dead, and you had nothing left except for the needle in your arm."
      ]
    },

    {
      "id": 8,
      "nextId": 9,
      "speakersName": "Blake",
      "characterSpritesName": "Blake",
      "startingSprite": "Default",
      "theme": "VNT_Default",
      "sentences":
      [
        "You manipulated me. Every damn step of the way. You saw how broken I was and took advantage of it.",
        "Every time I tried to leave, you pulled me back in. Made me feel like I owed you something. Like I was nothing without you."
      ]
    },

    {
      "id": 9,
      "nextId": 10,
      "speakersName": "Delta",
      "characterSpritesName": "Delta",
      "startingSprite": "Default",
      "theme": "VNT_Default",
      "sentences":
      [
        "You want the truth? Fine. Yeah, I fucking used you. Because you were useful. Because you were good at it. I saw something in you, Blake. You were a natural.",
        "And don’t pretend like you didn’t love it. The thrill, the power. It made you feel alive, didn’t it? It was the only thing left that made you feel anything."
      ]
    },

    {
      "id": 10,
      "nextId": 11,
      "speakersName": "Blake",
      "characterSpritesName": "Blake",
      "startingSprite": "Default",
      "theme": "VNT_Default",
      "sentences":
      [
        "No... I hated it. I hated every second of it. I was drowning, Delta. And you just stood there, watching me sink, feeding me the rope to hang myself with."
      ]
    },

    {
      "id": 11,
      "nextId": 12,
      "speakersName": "Delta",
      "characterSpritesName": "Delta",
      "startingSprite": "Default",
      "theme": "VNT_Default",
      "sentences":
      [
        "You’re full of shit. You wanna act like you’re the victim now? Like you’re better than me?",
        "I saw you freeze up in Glenwood, shaking like a fucking leaf. You were scared. Scared out of your mind.",
        "But you still did it. You got out of the car, and you pulled the trigger. Not because I told you to, but because you had nowhere else to go. Because you couldn't afford another shot."
      ]
    },

    {
      "id": 12,
      "nextId": 13,
      "speakersName": "Blake",
      "characterSpritesName": "Blake",
      "startingSprite": "Default",
      "theme": "VNT_Default",
      "sentences":
      [
        "We’re not the same, Delta. I never wanted this. I never wanted to become this monster."
      ]
    },

    {
      "id": 13,
      "nextId": 14,
      "speakersName": "Delta",
      "characterSpritesName": "Delta",
      "startingSprite": "Default",
      "theme": "VNT_Default",
      "sentences":
      [
        "And yet here you are, standing in the same fucking place as me. You think you’re different? You think you’re better?",
        "You’re just another junkie with a gun, desperate for the next fix.",
        "That’s all you ever were. A narcissistic, broken mess who needed a stage—any stage—to perform on. And when the music died, you found a new rhythm. The sound of a bullet casing hitting the floor."
      ]
    },

    {
      "id": 14,
      "nextId": 15,
      "speakersName": "Blake",
      "characterSpritesName": "Blake",
      "startingSprite": "Default",
      "theme": "VNT_Default",
      "sentences":
      [
        "You used me. You fucking used me until there was nothing left."
      ]
    },

    {
      "id": 14,
      "speakersName": "Blake",
      "characterSpritesName": "Blake",
      "startingSprite": "Default",
      "theme": "VNT_Default",
      "sentences":
      [
        "Yeah, I used you! Because you were fucking USEFUL! And you used me too, Blake! Don’t act like you didn’t! You used me to feed your addiction, to feed your broken, fucked-up ego.",
        "<action=toLoadScreen>"
      ]
    }
  ],
  "actions":
  [
    // Act popup action
    {
      "name": "toLoadScreen",
      "type": "sendMessage",
      "target": "PA_LevelManager",
      "message": "LoadLevel"
    }
  ]
}